// Написати цикли, які роблять наступне:
//    Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
let numberOne = '';
for (let i = 20; i <= 30; i += 0.5){
    numberOne += i + ' ';
}
console.log(numberOne.trim());

//    Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

for (let i = 10; i <= 100; i += 10){
    console.log(i * 27);
}

//    Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

const numberTwo = 23;
for (let i = 1; i <= 100; i++){
    if (i ** 2 <= numberTwo){
        console.log(i);
    }
}

//    Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1,
//          які не мають інших дільників крім 1 і себе).

const numberThree = 10;
for (let i = 2; i < numberThree; i++) {
    if (numberThree % i === 0) {
        console.log(`Число ${numberThree} є простотим`)
    }
}

//    Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3
//          у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let numberFour = 70;
while (numberFour % 3 === 0) {
    numberFour /= 3;
}
numberFour === 1 ? console.log(`Можна одержати`) : console.log(`Не можна одержати`);
